app/controllers/admin/levels_controller.rb

  def index
    @levels = Level.all
---
SELECT * FROM `levels`

  def show
    @level = Level.find(params[:id])
---
SELECT * FROM `levels` WHERE (`levels`.`id` = 4)

  def edit
    @level = Level.find(params[:id])
---
SELECT * FROM `levels` WHERE (`levels`.`id` = 4)

  def create
    @level = Level.new(params[:level])

    respond_to do |format|
      if @level.save
---
INSERT INTO `levels` (`name`) VALUES(NULL)

  def update
    @level = Level.find(params[:id])

    respond_to do |format|
      if @level.update_attributes(params[:level])
---
SELECT * FROM `levels` WHERE (`levels`.`id` = 6)
UPDATE `levels` SET `name` = 'admin123' WHERE `id` = 6

  def destroy
    @level = Level.find(params[:id])
    @level.destroy
---
SELECT * FROM `levels` WHERE (`levels`.`id` = 1)
DELETE FROM `levels` WHERE `id` = 1