app/controllers/activations_controller.rb

    def find_user_by_activation_code
      @user = User.find_using_perishable_token(params[:activation_code], 1.week)
---
SELECT * FROM `users` WHERE (perishable_token = 'nWvbAbhgHSWQfRdhVtR1' and updated_at > '2009-05-14 12:30:24') LIMIT 1