app/controllers/companies_controller.rb

SELECT * FROM `companies` WHERE (`companies`.`id` = 1)
---
  def show
    @company = Company.find(params[:id])

SELECT * FROM `companies` WHERE (`companies`.`id` = 2)
---
  def edit
    @company = Company.find(params[:id])

INSERT INTO `companies` (`updated_at`, `title`, `description`, `user_id`, `created_at`) VALUES('2009-06-29 18:08:19', 'company 1', 'description', NULL, '2009-06-29 18:08:19')
---
  def create
    @company = current_user.companies.build(params[:company])

    respond_to do |format|
      if @company.save

SELECT * FROM `companies` WHERE (`companies`.`id` = 22)
UPDATE `companies` SET `description` = 'test description', `updated_at` = '2009-06-29 18:36:27' WHERE `id` = 25
---
  def update
    @company = Company.find(params[:id])

    respond_to do |format|
      if @company.update_attributes(params[:company])

SELECT * FROM `companies` WHERE (`companies`.`id` = 12)
DELETE FROM `companies` WHERE `id` = 12
---
  def destroy
    @company = Company.find(params[:id])
    @company.destroy