app/controllers/password_resets_controller.rb

   def create
     @user = User.find_by_email(params[:email])
---
SELECT * FROM `users` WHERE (`users`.`email` = 'rajib.crri@gmail.com') LIMIT 1

  def update
    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]
    respond_to do |format|
      if @user.save_without_session_maintenance
---
UPDATE `users` SET `login_count` = 2, `persistence_token` = '2581e579ef96162c9d9b866eb296be8d5464542e2419dbd2d02ed6a233b47f8f9a43ac065b6d8644820be2221291f27d39352a1365603c1ae1eb00667bd76c90', `perishable_token` = 'AoxA-6xab2Y4W20w58Rf', `crypted_password` = '$2a$10$7j6dbc5Ot5xqTMY7Hn9ESu8xJDiqbzMqukVFSOAc/Q0ou98ilFaKW', `last_login_at` = '2009-05-21 12:33:49', `last_login_ip` = '127.0.0.1', `updated_at` = '2009-05-21 13:03:57', `last_request_at` = '2009-05-21 13:03:57', `current_login_at` = '2009-05-21 13:03:57', `password_salt` = 'l2rM9xAxTj1OItAbP6Gr' WHERE `id` = 1

    def load_user_using_perishable_token
      @user = User.find_using_perishable_token(params[:id])
---
SELECT * FROM `users` WHERE (perishable_token = 'ZCGvKXKeQI_2iyIC1vpN' and updated_at > '2009-05-21 12:53:57') LIMIT 1