app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save_without_session_maintenance
---
INSERT INTO `users` (`last_login_at`, `level_id`, `last_request_at`, `updated_at`, `crypted_password`, `current_login_ip`, `perishable_token`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `first_name`, `login`, `last_name`, `last_login_ip`, `active`, `created_at`, `email`) VALUES(NULL, NULL, NULL, '2009-06-26 19:01:46', '$2a$10$NH95B2Kjf/9O1pYYK.AuTerNOqOpjQJZ1hWtf3kakyS65rJA2TRNK', NULL, 'e-FEbENaAgBfyIS0Va4R', 'ko8qvI8nqYqP97n80hIb', NULL, 'fe6090a51d0189a78b6c9edbf24cf535fee9e87501a7b6076ec05290d61b577d45ee322fb86f0cb550333655a7fd7fe3dafda5699686979619b45c3b182bd624', 0, 'rajib', 'rajib', 'chowdhury', NULL, 0, '2009-06-26 19:01:46', 'chowdhury284@gmail.com')

  def update
    @user = current_user

    if @user.update_attributes(params[:user])
---
UPDATE `users` SET `perishable_token` = '-g0xhRDc5QT2TSXiJ2WJ', `updated_at` = '2009-06-26 19:04:32', `last_request_at` = '2009-06-26 19:04:32' WHERE `id` = 1